{
    "title": "Downtown Discovery",
    "description": "Explore the heart of the city on this exciting scavenger hunt! Follow the clues to uncover hidden gems and local history.",
    "clues": [
        {
            "id": 1,
            "location": {
                "lat": 37.7749,
                "lng": -122.4194
            },
            "arrivalRadius": 30,
            "initialClue": "Start where the cable cars turn around, where tourists gather and the bay breeze blows. Find the spot where the tracks make a circle.",
            "hints": [
                {
                    "type": "text",
                    "content": "It's at the end of Powell Street, near Market"
                },
                {
                    "type": "compass",
                    "content": null
                },
                {
                    "type": "distance",
                    "content": null
                }
            ],
            "reveal": {
                "photos": ["cable_car_turnaround"],
                "text": "You found the Powell Street Cable Car Turnaround! This iconic spot has been delighting visitors since 1873. Watch as conductors manually rotate the cars on the wooden turntable."
            },
            "unlockNext": "automatic",
            "passcode": null
        },
        {
            "id": 2,
            "location": {
                "lat": 37.7879,
                "lng": -122.4074
            },
            "arrivalRadius": 25,
            "initialClue": "Seek the pyramid that watches over the financial district. Not built by pharaohs, but by modern architects reaching for the sky.",
            "hints": [
                {
                    "type": "text",
                    "content": "Look for the distinctive pointed skyscraper on Columbus Avenue"
                },
                {
                    "type": "compass",
                    "content": null
                },
                {
                    "type": "distance",
                    "content": null
                }
            ],
            "reveal": {
                "photos": ["transamerica_pyramid"],
                "text": "The Transamerica Pyramid! At 853 feet, it was the tallest building in San Francisco when completed in 1972. The unique shape was designed to allow more light to reach the streets below."
            },
            "unlockNext": "passcode",
            "passcode": "1972"
        },
        {
            "id": 3,
            "location": {
                "lat": 37.8024,
                "lng": -122.4058
            },
            "arrivalRadius": 35,
            "initialClue": "Journey to where chocolate meets history. Ghirardelli's sweet legacy awaits in a square of red brick buildings overlooking the water.",
            "hints": [
                {
                    "type": "text",
                    "content": "Head north toward the waterfront, past Fisherman's Wharf"
                },
                {
                    "type": "compass",
                    "content": null
                },
                {
                    "type": "distance",
                    "content": null
                }
            ],
            "reveal": {
                "photos": ["ghirardelli_square"],
                "text": "Welcome to Ghirardelli Square! This former chocolate factory has been transformed into a bustling marketplace. The Ghirardelli family began making chocolate here in 1893, and you can still enjoy their famous hot fudge sundaes today!"
            },
            "unlockNext": "automatic",
            "passcode": null
        }
    ]
}
